tap "aws/tap"
tap "fastrepl/hyprnote"
tap "homebrew/bundle"
tap "homebrew/services"
tap "minacle/chntpw"
tap "osrf/simulation"
tap "teamookla/speedtest"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# TIFF library and utilities
brew "libtiff"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Download with resuming and segmented downloading
brew "aria2"
# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# YAML Parser
brew "libyaml"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Collection of portable C++ source libraries
brew "boost"
# Physics SDK
brew "bullet"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Open-source formatting library for C++
brew "fmt"
# Object-file caching compiler wrapper
brew "ccache"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# GNU compiler collection
brew "gcc"
# Library for processing command-line flags
brew "gflags"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Rich and complete approach to parallelism in C++
brew "tbb"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# File format designed to store large amounts of data
brew "hdf5"
# Implementation of the file(1) command
brew "libmagic"
# Anti-virus software
brew "clamav"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Utility that creates projects from templates
brew "cookiecutter"
# High-performance, asynchronous messaging library
brew "zeromq"
# Header-only C++ binding for libzmq
brew "cppzmq"
# Collision detection between two convex shapes
brew "libccd"
# Flexible Collision Library
brew "fcl"
# Fast Library for Approximate Nearest Neighbors
brew "flann"
# Interior point optimizer
brew "ipopt"
# Free/open-source library for nonlinear optimization
brew "nlopt"
# Simulating articulated rigid body dynamics
brew "ode"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# 3D graphics toolkit
brew "open-scene-graph"
# Improved tinyxml (in memory efficiency and size)
brew "tinyxml2"
# Unified Robot Description Format (URDF) parser
brew "urdfdom"
# Dynamic Animation and Robotics Toolkit
brew "dartsim"
# Isolated development environments using Docker
brew "docker-compose"
# Generate documentation for several programming languages
brew "doxygen"
# C++ template library for linear algebra
brew "eigen@3", link: true
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Cryptographic & SSL/TLS library
brew "mbedtls"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# High performance message passing library
brew "open-mpi"
# Library for FreeImage, a dependency-free graphics library
brew "freeimage"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GNU awk utility
brew "gawk"
# Package for scientific computing with Python
brew "numpy"
# Validating XML parser
brew "xerces-c"
# Geospatial Data Abstraction Library
brew "gdal"
# Implementation of the ANS Forth language
brew "gforth"
# GitHub command-line tool
brew "gh"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# AVH edition of git-flow
brew "git-flow-avh"
# Git extension for versioning large files
brew "git-lfs"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Library for Linear and Mixed-Integer Programming
brew "glpk"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Audio Connection Kit
brew "jack"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Cross-platform application and UI framework
brew "qt@5"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Qt Widgets for Technical Applications
brew "qwt-qt5"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# SoapySDR RTL-SDR Support Module
brew "soapyrtlsdr"
# Hardware driver for all USRP devices
brew "uhd"
# Vector Optimized Library of Kernels
brew "volk"
# SDK for signal processing blocks to implement software radios
brew "gnuradio"
# C++ microbenchmark support library
brew "google-benchmark"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# DRY and RAD for regular expressions and then some
brew "grok"
# Development framework for multimedia applications
brew "gstreamer"
# Low cost software radio platform
brew "hackrf"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Utils for conversion of cap/pcap/pcapng WiFi dump files
brew "hcxtools"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Offline radio signal analyser
brew "inspectrum"
# Peer-to-peer hypermedia protocol
brew "ipfs"
# Interactive computing in Python
brew "ipython"
# Dex to Java decompiler
brew "jadx"
# Library for interacting with JSON
brew "jsoncpp"
# Statically typed programming language for the JVM
brew "kotlin"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Library providing read access on ZIP-archives
brew "libzzip"
# Apple Silicon Monitor Top written in Golang
brew "mactop"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Open source computer vision library
brew "opencv"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Nonlinear and differential/algebraic equations solver
brew "sundials"
# Open-source modeling and simulation tool
brew "openmodelica", link: false
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Generic machine emulator and virtualizer
brew "qemu"
# JSON parser/generator for C++ with SAX and DOM style APIs
brew "rapidjson"
# Persistent key-value database, with built-in net interface
brew "redis"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# SOcket CAT: netcat on steroids
brew "socat"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# The Offline NT Password Editor
brew "minacle/chntpw/chntpw"
# Scene-oriented 3D engine written in c++
brew "osrf/simulation/ogre1.9"
# Scene-oriented 3D engine written in c++
brew "osrf/simulation/ogre2.3"
# Gazebo Sim robot simulator
brew "osrf/simulation/gz-sim9"
# Collection of gazebo simulation software
brew "osrf/simulation/gz-ionic"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Android SDK component
cask "android-platform-tools"
# Software-defined radio receiver powered by GNU Radio and Qt
cask "gqrx"
# Hyprnote application
cask "hyprnote"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source version of the X.Org X Window System
cask "xquartz"
vscode "anysphere.cursorpyright"
vscode "anysphere.pyright"
vscode "anysphere.remote-ssh"
vscode "armitxes.sqf"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "ckolkman.vscode-postgres"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-postgresql-client2"
vscode "dbaeumer.vscode-eslint"
vscode "dionmunk.vscode-notes"
vscode "editorconfig.editorconfig"
vscode "foolusion.acme-theme"
vscode "formulahendry.vscode-node-red"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "james-yu.latex-workshop"
vscode "julialang.language-julia"
vscode "k--kato.intellij-idea-keybindings"
vscode "mark-tucker.aws-cli-configure"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "octref.vetur"
vscode "openai.chatgpt"
vscode "qwtel.sqlite-viewer"
vscode "redhat.java"
vscode "tal7aouy.rainbow-bracket"
vscode "teabyii.ayu"
vscode "tgrospic.rholang"
vscode "uloco.theme-bluloco-dark"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "zhuangtongfa.material-theme"
go "github.com/btcsuite/btcd/cmd/addblock"
go "github.com/btcsuite/btcd/cmd/btcctl"
go "github.com/btcsuite/btcd"
go "github.com/btcsuite/btcd/cmd/findcheckpoint"
go "github.com/btcsuite/btcd/cmd/gencerts"
go "golang.org/dl/go1.24.4"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/securego/gosec/v2/cmd/gosec"
go "golang.org/x/vuln/cmd/govulncheck"
go "honnef.co/go/tools/cmd/staticcheck"
